{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "decoder_start_token_id": null,
  "dtype": "float32",
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Adjusted Body Weight",
    "1": "Albumin Corrected Anion Gap",
    "2": "Albumin Corrected Delta Gap",
    "3": "Albumin Corrected Delta Ratio",
    "4": "Anion Gap",
    "5": "Body Mass Index (BMI)",
    "6": "Body Surface Area Calculator",
    "7": "CHA2DS2-VASc Score for Atrial Fibrillation Stroke Risk",
    "8": "CKD-EPI Equations for Glomerular Filtration Rate",
    "9": "CURB-65 Score for Pneumonia Severity",
    "10": "Calcium Correction for Hypoalbuminemia",
    "11": "Centor Score (Modified/McIsaac) for Strep Pharyngitis",
    "12": "Charlson Comorbidity Index (CCI)",
    "13": "Child-Pugh Score for Cirrhosis Mortality",
    "14": "Creatinine Clearance (Cockcroft-Gault Equation)",
    "15": "Delta Gap",
    "16": "Delta Ratio",
    "17": "Estimated Gestational Age",
    "18": "Estimated of Conception",
    "19": "FeverPAIN Score for Strep Pharyngitis",
    "20": "Fibrosis-4 (FIB-4) Index for Liver Fibrosis",
    "21": "Fractional Excretion of Sodium (FENa)",
    "22": "Framingham Risk Score for Hard Coronary Heart Disease",
    "23": "Free Water Deficit",
    "24": "Glasgow Coma Score (GCS)",
    "25": "Glasgow-Blatchford Bleeding Score (GBS)",
    "26": "HAS-BLED Score for Major Bleeding Risk",
    "27": "HEART Score for Major Cardiac Events",
    "28": "HOMA-IR (Homeostatic Model Assessment for Insulin Resistance)",
    "29": "Ideal Body Weight",
    "30": "LDL Calculated",
    "31": "MDRD GFR Equation",
    "32": "MELD Na (UNOS/OPTN)",
    "33": "Maintenance Fluids Calculations",
    "34": "Mean Arterial Pressure (MAP)",
    "35": "Morphine Milligram Equivalents (MME) Calculator",
    "36": "PERC Rule for Pulmonary Embolism",
    "37": "PSI Score: Pneumonia Severity Index for CAP",
    "38": "Revised Cardiac Risk Index for Pre-Operative Risk",
    "39": "SIRS Criteria",
    "40": "Sequential Organ Failure Assessment (SOFA) Score",
    "41": "Serum Osmolality",
    "42": "Sodium Correction for Hyperglycemia",
    "43": "Target weight",
    "44": "Wells' Criteria for DVT",
    "45": "Wells' Criteria for Pulmonary Embolism"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Adjusted Body Weight": 0,
    "Albumin Corrected Anion Gap": 1,
    "Albumin Corrected Delta Gap": 2,
    "Albumin Corrected Delta Ratio": 3,
    "Anion Gap": 4,
    "Body Mass Index (BMI)": 5,
    "Body Surface Area Calculator": 6,
    "CHA2DS2-VASc Score for Atrial Fibrillation Stroke Risk": 7,
    "CKD-EPI Equations for Glomerular Filtration Rate": 8,
    "CURB-65 Score for Pneumonia Severity": 9,
    "Calcium Correction for Hypoalbuminemia": 10,
    "Centor Score (Modified/McIsaac) for Strep Pharyngitis": 11,
    "Charlson Comorbidity Index (CCI)": 12,
    "Child-Pugh Score for Cirrhosis Mortality": 13,
    "Creatinine Clearance (Cockcroft-Gault Equation)": 14,
    "Delta Gap": 15,
    "Delta Ratio": 16,
    "Estimated Gestational Age": 17,
    "Estimated of Conception": 18,
    "FeverPAIN Score for Strep Pharyngitis": 19,
    "Fibrosis-4 (FIB-4) Index for Liver Fibrosis": 20,
    "Fractional Excretion of Sodium (FENa)": 21,
    "Framingham Risk Score for Hard Coronary Heart Disease": 22,
    "Free Water Deficit": 23,
    "Glasgow Coma Score (GCS)": 24,
    "Glasgow-Blatchford Bleeding Score (GBS)": 25,
    "HAS-BLED Score for Major Bleeding Risk": 26,
    "HEART Score for Major Cardiac Events": 27,
    "HOMA-IR (Homeostatic Model Assessment for Insulin Resistance)": 28,
    "Ideal Body Weight": 29,
    "LDL Calculated": 30,
    "MDRD GFR Equation": 31,
    "MELD Na (UNOS/OPTN)": 32,
    "Maintenance Fluids Calculations": 33,
    "Mean Arterial Pressure (MAP)": 34,
    "Morphine Milligram Equivalents (MME) Calculator": 35,
    "PERC Rule for Pulmonary Embolism": 36,
    "PSI Score: Pneumonia Severity Index for CAP": 37,
    "Revised Cardiac Risk Index for Pre-Operative Risk": 38,
    "SIRS Criteria": 39,
    "Sequential Organ Failure Assessment (SOFA) Score": 40,
    "Serum Osmolality": 41,
    "Sodium Correction for Hyperglycemia": 42,
    "Target weight": 43,
    "Wells' Criteria for DVT": 44,
    "Wells' Criteria for Pulmonary Embolism": 45
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "prefix": null,
  "problem_type": "single_label_classification",
  "pruned_heads": {},
  "task_specific_params": null,
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.5.0",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": true,
  "vocab_size": 28996,
  "xla_device": null
}
